tutorials/cfdemSolverRhoPimpleChem/PolydisperseFluidizedBed/R1_FB/CFD/constant/foam.inp
species
(
        CO
        CO2
        H2
        H2O
        N2
);

reactions
{
}


